axis2-war/src/test/resources/TestSoapHeader3/HelloWorld.wsdl

<?xml version="1.0" encoding="utf-8" ?>
<!--
  ~ Licensed to the Apache Software Foundation (ASF) under one
  ~ or more contributor license agreements.  See the NOTICE file
  ~ distributed with this work for additional information
  ~ regarding copyright ownership.  The ASF licenses this file
  ~ to you under the Apache License, Version 2.0 (the
  ~ "License"); you may not use this file except in compliance
  ~ with the License.  You may obtain a copy of the License at
  ~
  ~    http://www.apache.org/licenses/LICENSE-2.0
  ~
  ~ Unless required by applicable law or agreed to in writing,
  ~ software distributed under the License is distributed on an
  ~ "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
  ~ KIND, either express or implied.  See the License for the
  ~ specific language governing permissions and limitations
  ~ under the License.
  -->
<wsdl:definitions
        targetNamespace="http://www.example.org/bpel/examples/wsdl"
        xmlns="http://schemas.xmlsoap.org/wsdl/"
        xmlns:tns="http://www.example.org/bpel/examples/wsdl"
	xmlns:types="http://www.example.org/cid"
        xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
        xmlns:xsd="http://www.w3.org/2001/XMLSchema"
        xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
        xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype">

	<wsdl:types>
		<xsd:schema targetNamespace="http://www.example.org/cid">
  			<xsd:element name="conversationId" type="xsd:string" />
		</xsd:schema>
	</wsdl:types>

    <wsdl:message name="HelloMessage">
        <wsdl:part name="TestPart" type="xsd:string"/>
	<wsdl:part name="conversationId" element="types:conversationId" />
    </wsdl:message>

    <wsdl:portType name="HelloPortType">
        <wsdl:operation name="hello">
            <wsdl:input message="tns:HelloMessage" name="TestIn"/>
            <wsdl:output message="tns:HelloMessage" name="TestOut"/>
        </wsdl:operation>
    </wsdl:portType>

    <wsdl:binding name="HelloSoapBinding" type="tns:HelloPortType">
        <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
        <wsdl:operation name="hello">
            <soap:operation soapAction="" style="rpc"/>
            <wsdl:input>
                <soap:body
                        namespace="http://www.example.org/bpel/examples/wsdl"
                        use="literal" parts="TestPart" />
 		<soap:header message="tns:HelloMessage"
                         part="conversationId" use="literal"/>
           </wsdl:input>
            <wsdl:output>
                <soap:body
                        namespace="http://www.example.org/bpel/examples/wsdl"
                        use="literal" parts="TestPart" />
 		<soap:header message="tns:HelloMessage"
                         part="conversationId" use="literal"/>
            </wsdl:output>
        </wsdl:operation>
    </wsdl:binding>
    <wsdl:service name="HelloService">
        <wsdl:port name="HelloPort" binding="tns:HelloSoapBinding">
            <soap:address location="http://localhost:8080/ode/processes/hello_world_header_wsdl"/>
        </wsdl:port>
    </wsdl:service>

    <plnk:partnerLinkType name="HelloPartnerLinkType">
        <plnk:role name="me" portType="tns:HelloPortType"/>
        <plnk:role name="you" portType="tns:HelloPortType"/>
    </plnk:partnerLinkType>
</wsdl:definitions>

