axis2-war/src/test/resources/TestSoapHeader3/testRequest.soap

<?xml version="1.0" encoding="utf-8" ?>
<!--
  ~ Licensed to the Apache Software Foundation (ASF) under one
  ~ or more contributor license agreements.  See the NOTICE file
  ~ distributed with this work for additional information
  ~ regarding copyright ownership.  The ASF licenses this file
  ~ to you under the Apache License, Version 2.0 (the
  ~ "License"); you may not use this file except in compliance
  ~ with the License.  You may obtain a copy of the License at
  ~
  ~    http://www.apache.org/licenses/LICENSE-2.0
  ~
  ~ Unless required by applicable law or agreed to in writing,
  ~ software distributed under the License is distributed on an
  ~ "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
  ~ KIND, either express or implied.  See the License for the
  ~ specific language governing permissions and limitations
  ~ under the License.
  -->
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cid="http://www.example.org/cid" xmlns:wsdl="http://www.example.org/bpel/examples/wsdl">
   <soapenv:Header>
      <cid:conversationId>1</cid:conversationId>
   </soapenv:Header>
   <soapenv:Body>
      <wsdl:hello>
         <TestPart>hello</TestPart>
      </wsdl:hello>
   </soapenv:Body>
</soapenv:Envelope>
